
////////////////////////////////////////////////////////////////////////////////////
// ЗАДАНИЕ

// Задание 1
// использовать сокращенную запись для:
// var num = 1;
// num = num + 12;
// num = num - 14;
// num = num * 5;
// num = num / 7;
// num = num + 1;
// num = num - 1;
// console.log(num);

console.log("Задание 1 ================================");
var num = 1;
num += 12;
num -= 14;
num *= 5;
num /= 7;
num  = ++num;
num = --num;
console.log(num);


// Задание 2
// использовать сокращенную запись для:
// var num = 10;
// num = num + 1;
// num = num + 1;
// num = num - 1;

console.log("Задание 2 ================================");
var num = 10;
num = num++;
num = num++;
num = num--;
console.log(num);

// Задание 3
// использовать сокращенную запись для:
// var a = 10; 
// var b = 10;
// b = a + 5;
// var c = 10;
// a = c / 2;
// b = b - 1;
// c = b * c;
// a = c / a;
// c = c + 1;
// console.log(a,b,c);

console.log("Задание 3 ================================");
var a = 10;
var b = 10;
b  = a += 5;
var c = 10;
a = c /= 2;
b = b--;
c = b *= c;
a = c /= a;
c = c++;
console.log(a, b, c);
//sdfgserdgd

// Задание 4
// Посчитать в уме/на бумаге
//  m = n = k = 5
//  m += --n
//  m /= ++k - --n
// Ответ:
// m = 
// n = 
// k = 
console.log("Задание 4 ================================");
m = n = k = 5;
m += --n;
m /= ++k - --n;
m = 3;
n = 3;
k = 6;

// Задание 5
// не копируя, обменять значения переменных, без помощи доп переменной
// 
console.log("Задание 5 ================================");
var j = 2;
var k = 3;
k = j + k;
j = k - j;
k = k - j;
console.log(j,k);

// Задание 6
// написать тригонометрическую функцию
// 002r3.jpg
console.log("Задание 6 ================================");
var x = 1;
var y = (x**2 + Math.sin(x)) / Math.sqrt(x);
console.log(y);
